#include <stdio.h>
/*
[입력]
● 비트연산자를 수행할 두 개의 입력
[출력]
● 입력 받은 두 정수 x, y에서 다음 비트 연산의 결과를 출력
■ x, y, x & y, x | y, x ^ y, x >> y, x << y, ~x, ~y, ~x + 1. ~y + 1 등을 출력
■ 이진수는 다음과 같이 4자리 출력 후 빈 공간 출력

32bit=4byte int
비트연산을 수행할 두 개의 정수를 입력하세요. >> 387 5
387:                     0000 0000 0000 0000 0000 0001 1000 0011
5:                          0000 0000 0000 0000 0000 0000 0000 0101
387 & 5 = 1:         0000 0000 0000 0000 0000 0000 0000 0001
387 | 5 = 391:       0000 0000 0000 0000 0000 0001 1000 0111
387 ^ 5 = 390:      0000 0000 0000 0000 0000 0001 1000 0110
387 >> 5 = 12:      0000 0000 0000 0000 0000 0000 0000 1100
387 << 5 = 12384:  0000 0000 0000 0000 0011 0000 0110 0000
~387 = -388:       1111 1111 1111 1111 1111 1110 0111 1100
~ 5 = -6:          1111 1111 1111 1111 1111 1111 1111 1010


*/

void int_to_bit(unsigned int *input,int bit[10][32])
{
	int i;
	for (i = 31; i >= 0; --i) { //8자리 숫자까지 나타냄
    	*bit[i] = num >> i & 1;
    }
}


print_all(){
	char[8][40];
	//이중 배열로 출력할 문자 넣어서 %s로 출력 
}


int main (void)
{
	
	unsigned int a=0,b=0,res[10]={0};
	int bit[10][32];
	printf("enter two num: ");
	scanf("%d %d",&a,&b);
	
	res[0]=a;
	res[1]=b;
	res[2]=a&b;
	res[3]=a|b;
	res[4]=a^b;
	res[5]=a>>b;
	res[6]=a<<b;
	res[7]=~a;
	res[8]=~b;
	for(i=0;i<7;i++){
		printf("")
		int_to_bit(res[i],bit[i][32]);
	}
	
	
	
	
	return 0;
}
